#include <iostream>
using namespace std;

int main() {
	//指针的定义和使用
	//1,定义一个变量
	int a = 10;
	//2,使用指针，指针的类型和变量类型需要一致，&为变量取址符
	int* p = &a;
	cout << "变量a的地址指针p：" << (int)p << endl;
	cout << "通过指针解引用获取变量a的值：" << *p << endl;

	//指针也是一种数据类型，在32位操作系统下，占用4个自己，64位下占8个字节
	cout << "指针所占内存大小:" << sizeof(p) << endl;

	//空指针：指针变量指向内存中编号为0的空间，指向的内存空间是不可访问的
	//一般用作指针的初始化操作
	int* n_p = NULL;
	cout << "空指针地址：" << n_p << endl;
	//错误 cout << "访问空指针地址的值：" << *n_p << endl;

	//野指针：指针变量指向非法的内存空间，不能随意指定未申请的内存地址访问，会有权限错误；
	int* y_p = (int*)0x0001;
	//错误 cout << "访问野指针指向的内存空间：" << *y_p << endl;


	return 0;
}