#include<iostream>
using namespace std;

int main() {
	/*
	const修饰指针的三种情况
	1，const修饰指针  --常量指针
	2，const修饰常量  --指针常量
	3，const修饰指针和常量
	*/

	//常量指针------------------------------------------------
	int a_01 = 10;
	int a_02 = 20;
	//const修饰指针，指针指向可以改变，指针指向的值不可以改变
	const int* a_p = &a_01;
	cout << "常量指针a_p：" << (int)a_p << endl;
	//修改指针指向
	a_p = &a_02;
	cout << "修改指针指向后，常量指针a_p：" << (int)a_p << endl;
	//错误 *a_p = 30;

	//指针常量-------------------------------------------------
	int b_01 = 10;
	int b_02 = 20;
	//const修饰常量，指针指向不可以修改，指针指向的值可以修改
	int* const b_p = &b_01;
	cout << "指针常量b_p指向的值：" << *b_p << endl;
	//修改指针指向的值
	*b_p = 30;
	cout << "修改指针指向的值后，指针常量b_p指向的值：" << *b_p << endl;
	//错误 b_p = &b_02;

	//const修饰指针和常量---------------------------------------
	int c_01 = 10;
	int c_02 = 20;
	//const既修饰指针，又修饰常量，指针的指向和指针指向的值都不可修改
	const int* const c_p = &c_01;
	//错误 c_p = &c_02
	//错误 *c_p = 30;
	return 0;
}